// 3. 工程師常常被同時賦予多項任務，請你根據內心的想法排序以下任務的優先級，並與我們分享為什麼或你的想法。
//     1. 團隊專案中已超過預定上線日多時的開發任務
//     2. 資料庫持續回傳連線逾時
//     3. 客戶反應系統付款按鈕點擊後沒有回應
//     4. 感覺再 30 分鐘可以研究出來的技術難題
//     5. 希望你幫忙處理部門同事休假時的專案問題
//     6. 已經持續兩週的個人開發任務

3 > 2 > 5 > 4 > 1 > 6
3 => 使用者體驗通常是非常重要的因素，尤其又關於付費向關直接影響到公司獲利的功能。
2 => 資料庫連線逾時可能會影響到使用者體驗，無法讓功能正常運作。
5 => 需要幫忙處理同事休假專案問題，可能蠻急迫的，也需先處理。
4 => 30分鐘可以解決的技術問題，可能對於系統有很大幫助，緊急事件處理完後的優先事項。
1 => 團隊專案超過上線時程，通常是團隊協作或是其他比較複雜的問題，無法短時間內獨自解決。
6 => 個人開發任務，通常還未經過有效驗證，屬於比較不急迫的開發，緊急事件與對公司較高效益事件，處理完後再執行。